app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-02-04 06:57:58.167858"], ["updated_at", "2018-02-04 06:57:58.167858"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 5], ["created_at", "2018-02-04 06:57:58.176319"], ["updated_at", "2018-02-04 06:57:58.176319"]]
---
  def upload
    CSV.foreach(params["file"].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])